In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([1,2,3,4,5])

In [3]:
df

   0
0  1
1  2
2  3
3  4
4  5

In [4]:
df = pd.DataFrame([[1,2,3],[4,5,6]])

In [5]:
df

   0  1  2
0  1  2  3
1  4  5  6

In [6]:
dados = {
    'A': [1,2,3],
    'B': [4,5,6],
    'C': [7,8,9]
}
df = pd.DataFrame(dados)

In [7]:
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [8]:
df['A']

0    1
1    2
2    3
Name: A, dtype: int64

In [9]:
df['D'] = df['A'] + df['B'] + df['C']

In [10]:
df

   A  B  C   D
0  1  4  7  12
1  2  5  8  15
2  3  6  9  18

In [11]:
df['A'].sum()

6

In [12]:
df['A'].mean()

2.0

In [13]:
notas = [
    {'Aluno': 'Lúcio', 'N1': 30.0, 'N2': 10.0, 'N3': 35.0},
    {'Aluno': 'Maria', 'N1': 23.0, 'N2': 30.0, 'N3': 18.0},
    {'Aluno': 'Ana', 'N1': 17.0, 'N2': 25.0, 'N3': 21.0},
]
df_nota = pd.DataFrame(notas)

In [14]:
df_nota

   Aluno    N1    N2    N3
0  Lúcio  30.0  10.0  35.0
1  Maria  23.0  30.0  18.0
2    Ana  17.0  25.0  21.0

In [17]:
df_nota['Total'] = df_nota['N1'] + df_nota['N2'] + df_nota['N3']

In [18]:
df_nota

   Aluno    N1    N2    N3  Total
0  Lúcio  30.0  10.0  35.0   75.0
1  Maria  23.0  30.0  18.0   71.0
2    Ana  17.0  25.0  21.0   63.0

In [20]:
df_nota['Total'].mean()

69.66666666666667

In [24]:
df_nota.append([{'Aluno': 'Carla', 'N1': 25.0, 'N2': 25.0, 'N3': 22.0}])

   Aluno    N1    N2    N3  Total
0  Lúcio  30.0  10.0  35.0   75.0
1  Maria  23.0  30.0  18.0   71.0
2    Ana  17.0  25.0  21.0   63.0
0  Carla  25.0  25.0  22.0    NaN